import Button from "../components/button/Button";
import FAQItem from "../components/questions/Questions"
import styles from "./ThirdScreen.module.css"

const ThirdScreen = () => {
  const faqItems = [
    {
      question: "האיפור כולל הדבקת ריסים?",
      answer: "האיפור כולל הדבקת ריסים, אין דבר כזה איפור בלי הדבקת ריסים. שיטת הדבקת הריסים שלי היא טבעית ונותנת סיומת יחודית ועדינה"
    },
    {
      question: "את מגיעה למקום ההתארגנות",
      answer: "מגיעה לכל מקום בארץ למקום ההתארגנות שלך"
    },
    {
      question: "כמה כלות את מאפרת ביום?",
      answer: "מאפרת כלה אחת ביום - חשוב לי לתת את כל היחס ותשומת הלב לכלה לכן אני לא מקבלת יותר מכלה אחת ביום"
    },
    {
      question: "את מאפרת מלוות?",
      answer: "מאפרת מלווה אחת בלבד.כדי שאוכל לתת את כל כולי ואת היחס הייחודי לכל אחת לא אוכל לקחת יותר ממלווה אחת."
    },
   
    {
      question: "את עושה איפור נסיון?",
      answer: "אני לא עושה איפור ניסיון. אבל אני עושה שיחת היכרות פנים מול פנים / בשיחת זום.איפור ניסיון לא מראה את האיפור האמיתי ויכול ליצור בלבול וחוסר ביטחון לכלה העתידית - לכן בשיחת היכרות אני מעדיפה להכיר את הכלה ואת הרצונות שלה ולעזור לה להתאים את האיפור שהכי יתאים לה ולסגנון שלה"
    },
    {
      question: "אני מפחדת שיירד לי האיפור",
      answer: "האיפור הוא מאוד עמיד - ובכל מקרה קיצון במידה ויש לך ליווי ממני אני כאן כדי לתקן אותו"
    },
    {
      question: "לא התאפרתי מעולם - איך אדע איזה תואם לעור שלי",
      answer: "אני יודעת להתאים את האיפור לכל אחת ואחת ובנוסף , בייעוץ ובשיחת ההכרות שלנו - נבין מה את מחפשת ומה הכי מתאים לך"
    }
  ];

  return <>
    <div dir="rtl">
      <div className={styles.title}>אתן שואלות ואני עונה</div>
      {faqItems.map((item, index) => (
        <FAQItem
          key={index}
          question={item.question}
          answer={item.answer}
        />
      ))}
    </div>
    <Button text="נופר, בואי נדבר!!"/>
</>
}

export default ThirdScreen