import Button from "../components/button/Button";
import FormScreen from "../components/form/FormScreen";
import FAQItem from "../components/questions/Questions"
import styles from "./ThirdScreen.module.css"

const ThirdScreen = () => {
  const faqItems = [
    {
      question: "מה כולל שירות איפור כלה?",
      answer: "השירות כולל שיחת היכרות, ייעוץ להכנת עור הפנים, איפור ביום האירוע ויחס אישי ומקצועי"
    },
    {
      question: "איך מתבצע תהליך האיפור ביום החתונה?",
      answer: "ביום האירוע, אפגש איתך בזמן שנקבע מראש ואדאג לאיפור מושלם ומותאם אישית"
    },
    {
      question: "מה קורה אם אני לא בטוחה לגבי סגנון האיפור שלי?",
      answer: "אני כאן כדי לעזור! בשיחת ההיכרות נוכל לדון ברעיונות ולקבוע את המראה המושלם עבורך"
    },
    {
      question: "האם אני יכולה לבקש שינויים באיפור ביום האירוע?",
      answer: "כמובן! אני פתוחה לשינויים ואשמח לבצע את השיפוטים שיביאו אותך למראה שאת חולמת עליו"
    },
    {
      question: "איך אני מכינה את עור הפנים לקראת האיפור?",
      answer: "במהלך הייעוץ, אעניק לך טיפים והמלצות להכנה מיטבית של עור הפנים"
    },
    {
      question: "האם האיפור כולל הדבקת ריסים?",
      answer: "אכן, האיפור כולל הדבקת ריסים, שכן אין טעם באיפור ללא אלמנט זה. שיטת הדבקת הריסים שלי מתמקדת ביצירה של מראה טבעי, תוך מתן סיומת ייחודית ועדינה להופעה הכללית"
    },
    {
      question: "האם את מגיעה למקום ההתארגנות?",
      answer: "אני מספקת שירותי הגעה לכל מקום בארץ, כך שאוכל להגיע ישירות למקום ההתארגנות שלך"
    },
    {
      question: "כמה כלות את מאפרת ביום?",
      answer: "אני מאפרת כלה אחת ביום בלבד, שכן אני שואפת להעניק לכל כלה את מלוא היחס ותשומת הלב. לכן, איני מקבלת יותר מכלה אחת ביום"
    },
    {
      question: "האם את מאפרת מלוות?",
      answer: "אני מאפרת מלווה אחת בלבד, על מנת להעניק את מלוא תשומת הלב והיחס הייחודי לכל מלווה. לכן, איני יכולה לקבל יותר ממלווה אחת באירוע"
    },
    {
      question: "יש לי חששות לגבי עמידות האיפור",
      answer: "האיפור שאני מספקת הוא בעל עמידות גבוהה מאוד. בנוסף, במקרים קיצוניים, אם תבחרי בליווי שלי, אני אעמוד לרשותך לתיקונים במידת הצורך"
    },
    {
      question: "אני מעולם לא התאפרתי. כיצד אדע איזה איפור מתאים לעור שלי?",
      answer: "אני מתמחה בהתאמת האיפור לכל אישה באופן אישי. במהלך הייעוץ ובשיחת ההיכרות שלנו, נוכל להבין יחד מה את מחפשת ומהו הסגנון שיתאים לך בצורה הטובה ביותר"
    }
  ];

  return <>
    <div dir="rtl">
      <div className={styles.title}>אתן שואלות ואני עונה</div>
      {faqItems.map((item, index) => (
        <FAQItem
          key={index}
          question={item.question}
          answer={item.answer}
        />
      ))}
    </div>
    <Button text="נופר, בואי נדבר!!"/>
    <div className={styles.description}>אני כאן כדי להבטיח שביום הגדול שלך תרגישי הכי יפה והכי בטוחה בעצמך. אל תהססי לפנות אליי לקביעת שיחת היכרות!</div>
    <div className={styles.title}>מלאי את הפרטים הבאים, ואשוב אלייך בהקדם האפשרי.</div>
<FormScreen/>
<div className={styles.title}>מחכה לפגוש אותך</div>
  </>
}

export default ThirdScreen