import React from 'react';
import styles from './Me.module.css';
import nofar from "../../images/נופר חלפון תדמית.png"
import Button from '../button/Button';
const AboutMe = () => {
  return (
    <>
      <div className={styles.header} id="מי אני">נעים מאוד</div>
      <div className={styles.container}>
        <div className={styles.imageContainer}>
          <img src={nofar} alt="נופר חלפון" className={styles.image} />
        </div>
        <div className={styles.content}>
          <h1 className={styles.title}>נופר חלפון</h1>
          <div className={styles.subtitle}>"מבחינתי לאפר זה שליחות"</div>
          <p className={styles.description}>
          איפור כלות עבורי מהווה יותר מאשר מקצוע זו שליחות שמאפשרת לי לגעת בנשמות של אנשים ולסייע להם להרגיש יפים ובטוחים בעצמם ביום החשוב והמרגש ביותר בחייהם. מאז שאני זוכרת את עצמי, אני עוסקת באמנות האיפור, והניסיון שלי נצבר דרך עבודה עם חברות מובילות בתחום, כמו גם איפור בתצוגות אופנה בישראל. עם זאת, מה שממלא אותי בשמחה ובסיפוק רב במיוחד הוא ההזדמנות לאפר כלות ולחוות את הרגע הקסום שבו הן מתבוננות במראה ומגלות את יופיין האמיתי, הרגע שבו הן מתמלאות בהתרגשות ובביטחון.
          </p>
          <p className={styles.description}>
          אני מאמינה שהאיפור הוא יותר מאשר פשוט מריחת צבעים זו אמנות שמחייבת מקצועיות, רגישות והקשבה עמוקה לצרכים ולרצונות של כל כלה. מתוך ההבנה הזו, אני בוחרת לקבל רק כלה אחת ביום, כך שאוכל להעניק לה את כל תשומת הלב והזמן הראויים. עבורי, כל כלה היא עולם ומלואו, ומרגע ההיכרות שלנו ועד ליצירת המראה המדויק שתמיד חלמה עליו, אני מחויבת להעניק לה את החוויה הטובה ביותר. ביום חתונתך, תקבלי ממני לא רק איפור מקצועי ועמיד, אלא גם אווירה רגועה, ליווי צמוד והרגשה מלאה של ביטחון, כך שתוכלי להיות בטוחה שאת נראית כפי שתמיד חלמת.
          </p>
        </div>
      </div>
      
    </>
  );
};

export default AboutMe;